{
  "backend/main.mo": "Main backend actor handling user profiles, access control, Stripe checkout/session status, booking types, and storage mixins.",
  "feature_evidence.json": "Feature-evidence report mapping feature requests to affected frontend files and components with associated metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of major frontend React components and hooks.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme color variables and applying base background/foreground rules.",
  "frontend/index.html": "Base HTML entrypoint loading the React app via main.tsx with metadata and root container.",
  "frontend/src/App.tsx": "Main application wrapper rendering landing page sections within access control, error diagnostics, and dark-theme provider.",
  "frontend/src/components/AccessCodeGate.tsx": "Access-gate component requiring a fixed code to reveal the app, storing unlock state in sessionStorage with manual reset.",
  "frontend/src/components/AccessRestrictedScreen.tsx": "Placeholder component file with no implemented content.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard that checks admin status and displays bookings with tabs for bookings and availability.",
  "frontend/src/components/AvailabilityEditor.tsx": "Empty file with no implementation.",
  "frontend/src/components/BookingSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/BookingsManager.tsx": "Empty file with no implementation.",
  "frontend/src/components/BuildFailureDiagnostics.tsx": "Displays captured build errors in a modal with copying and dismissal tools for debugging.",
  "frontend/src/components/EthicsAndBoundaries.tsx": "Static section outlining ethical guidelines, boundaries, and disclaimers for the service.",
  "frontend/src/components/Footer.tsx": "Footer with branding, quote, and attribution including a link to caffeine.ai.",
  "frontend/src/components/Hero.tsx": "Hero section with background imagery, gold accents, and messaging introducing The Clearing.",
  "frontend/src/components/InviteGate.tsx": "Gate component that unlocks access when a valid invite secret is found in the URL or session storage.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a payment-cancelled message with instructions and a button to return home.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays a payment confirmation with optional booking details and a return-home button.",
  "frontend/src/components/PractitionerAuthority.tsx": "Section presenting the practitioner’s bio, experience, headshot, and social links.",
  "frontend/src/components/PriceAndValue.tsx": "Displays the session price, duration, and value framing within a styled SectionShell layout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ReadyToBookCTA.tsx": "Renders a call‑to‑action section with a button that redirects users to an external booking link.",
  "frontend/src/components/SectionShell.tsx": "Reusable layout wrapper providing spacing, visuals, optional accent labels, and background variants.",
  "frontend/src/components/SessionStructure.tsx": "Outlines the four‑step structure of a session using numbered sections within a styled layout.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/WhatItIs.tsx": "Explains what The Clearing is, what it is not, and clarifies its principles using structured text and lists.",
  "frontend/src/components/WhatToExpect.tsx": "Describes expected benefits and outcomes of The Clearing with a detailed list of practical value points.",
  "frontend/src/components/WhoThisIsFor.tsx": "Lists criteria for who the session is suitable for and who it is not, using two structured columns.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, handling login state, stored identities, and exposing login/clear methods.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks that call backend actor methods for user profiles, Stripe config, checkout sessions, and bookings with automatic cache invalidation.",
  "frontend/src/index.css": "Defines base Tailwind styles, theme variables, dark mode overrides, typography rules, and a gold shimmer animation.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/captureAppErrors.ts": "Implements a global error capture utility that records runtime and promise errors, stores them, and notifies subscribers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, radii, shadows, plugins, and theme extensions tied to CSS variables.",
  "project_state.json": "Captures the current architecture and status of the DApp, including frontend/backend design, authentication, scheduling, payments, and admin tools. Also documents architectural notes and known issues with time handling, booking flow, payment verification, and state persistence."
}