{
  "backend/main.mo": "Actor managing user profiles, Stripe checkout/session handling, authorization checks, and booking-related type definitions.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, impacted files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing component purposes and UI behavior.",
  "frontend/index.css": "Global Tailwind base/theme variables with dark‑mode OKLCH palette and shared styling primitives.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level app layout applying ThemeProvider, AccessCodeGate, error diagnostics, and all landing page sections.",
  "frontend/src/components/AccessCodeGate.tsx": "Visual access-code gate requiring code 1122 with animations, session persistence, and manual lock reset.",
  "frontend/src/components/AccessRestrictedScreen.tsx": "Empty placeholder component.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard showing bookings and placeholder availability tab with admin permission checks.",
  "frontend/src/components/AvailabilityEditor.tsx": "Empty placeholder component.",
  "frontend/src/components/BookingSection.tsx": "Empty placeholder component.",
  "frontend/src/components/BookingsManager.tsx": "Empty placeholder component.",
  "frontend/src/components/BuildFailureDiagnostics.tsx": "Displays captured build or deployment errors with stack traces and allows copying or dismissing them.",
  "frontend/src/components/EthicsAndBoundaries.tsx": "Renders a content section outlining ethical boundaries, disclaimers, and user responsibilities.",
  "frontend/src/components/Footer.tsx": "Provides a styled site footer with a quote and attribution link.",
  "frontend/src/components/Hero.tsx": "Renders the landing hero section with background imagery, decorative overlays, and a title and tagline.",
  "frontend/src/components/InviteGate.tsx": "Restricts page access based on an invite token in the URL, showing a locked screen until unlocked.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a cancellation notice after failed payment and offers a button to return home.",
  "frontend/src/components/PaymentSuccess.tsx": "Confirms successful payment, displaying optional booking details pulled from URL parameters.",
  "frontend/src/components/PractitionerAuthority.tsx": "Displays practitioner bio, photo, and social links along with descriptive background information.",
  "frontend/src/components/PriceAndValue.tsx": "Presents pricing details for a 90‑minute session along with explanatory text about the value of the service.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/ReadyToBookCTA.tsx": "Displays a call‑to‑action section inviting users to book a session with a styled button linking externally.",
  "frontend/src/components/SectionShell.tsx": "Reusable layout wrapper providing consistent spacing, backgrounds, motifs, and optional labels or dividers for sections.",
  "frontend/src/components/SessionStructure.tsx": "Renders a four‑phase breakdown of the session flow with titles, durations, and descriptions.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/WhatItIs.tsx": "Explains what The Clearing™ is, what it is not, and uses structured text and lists to clarify scope and boundaries.",
  "frontend/src/components/WhatToExpect.tsx": "Outlines expected outcomes and session behaviors using descriptive text and bullet lists.",
  "frontend/src/components/WhoThisIsFor.tsx": "Defines who the service is suitable for and who it is not, presented in two parallel structured lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, handling authentication state and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, clearing identity, and tracking login status states.",
  "frontend/src/hooks/useQueries.ts": "Wraps common backend actor calls in React Query hooks for user profiles, Stripe config, checkout sessions, and bookings with automatic caching and invalidation.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS custom properties, typography, dark mode variables, and decorative motif utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing QueryClient and wrapping the app with InternetIdentityProvider.",
  "frontend/src/utils/captureAppErrors.ts": "Implements a global error capture utility that records, retrieves, clears, and broadcasts frontend runtime and promise rejection errors.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, storing, persisting, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, shadows, and container settings, plus plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project’s schema/version and provides a detailed description of the DApp’s frontend, backend, architecture, and known issues. Serves as a high-level project manifest for build planning and state tracking."
}