{
  "backend/main.mo": "Main backend actor handling user profiles, access control, Stripe sessions, and booking-related types with storage mixins and authorization checks.",
  "feature_evidence.json": "Feature evidence report describing replacement of facilitator headshot in PractitionerAuthority using a new uploaded static asset.",
  "frontend-file-summaries.txt": "Pre-generated summaries of major frontend components including UI sections, admin tools, and integrations.",
  "frontend/index.css": "Global Tailwind base layer defining theme variables, dark mode styles, and global background/foreground rules.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component applying theme, access gate, and composing all landing page sections.",
  "frontend/src/components/AccessCodeGate.tsx": "Client-side access-code gate requiring code 1122 before revealing page content with sessionStorage persistence.",
  "frontend/src/components/AccessRestrictedScreen.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminDashboard.tsx": "Empty placeholder for admin dashboard component.",
  "frontend/src/components/AvailabilityEditor.tsx": "Empty placeholder for availability editor component.",
  "frontend/src/components/BookingSection.tsx": "Empty placeholder for booking section component.",
  "frontend/src/components/BookingsManager.tsx": "Empty placeholder for bookings manager component.",
  "frontend/src/components/EthicsAndBoundaries.tsx": "Static content section outlining ethical guidelines, boundaries, and disclaimers for sessions.",
  "frontend/src/components/Footer.tsx": "Footer with maxim statement and small attribution line using gold-accent heart icon.",
  "frontend/src/components/Hero.tsx": "Hero section with authority-themed background and CTA button linking to Linktree booking.",
  "frontend/src/components/InviteGate.tsx": "Empty placeholder for invite gate component.",
  "frontend/src/components/PaymentFailure.tsx": "Empty placeholder for payment failure screen.",
  "frontend/src/components/PaymentSuccess.tsx": "Empty placeholder for payment success screen.",
  "frontend/src/components/PractitionerAuthority.tsx": "Practitioner profile section using new facilitator headshot asset, bio details, and non-clickable social icons.",
  "frontend/src/components/PriceAndValue.tsx": "Displays pricing for a $177, 75‑minute private session along with notes on value and boundaries.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file placeholder for a profile setup modal component.",
  "frontend/src/components/SessionStructure.tsx": "Outlines the four‑step structure of the 75‑minute session: clarity, insight, responsibility, and integration.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty file placeholder for a Stripe setup modal component.",
  "frontend/src/components/WhatItIs.tsx": "Explains what The Clearing™ is, its reflective tarot‑based approach, and clarifies what it is not.",
  "frontend/src/components/WhatToExpect.tsx": "Describes what happens during the session, who benefits most, and who the session is not designed for.",
  "frontend/src/components/WhoThisIsFor.tsx": "Defines criteria for who the work is suited for and who it is not, with a concluding readiness note.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity loading, and state management via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, Stripe setup, checkout sessions, and booking-related backend calls.",
  "frontend/src/index.css": "Defines Tailwind layers and OKLCH CSS variables for light/dark themes, and applies base typography and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL or sessionStorage parameters, with support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color tokens, fonts, spacing, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s architecture, features, and known issues for the booking and payment DApp, including frontend/backend behavior and Stripe integration."
}