{
  "backend/main.mo": "Main backend canister handling user profiles, access control, Stripe checkout operations, bookings, and availability types with authorization checks.",
  "feature_evidence.json": "Feature evidence report linking a specific landing‑page copy update to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing component purpose and UI behavior.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables and dark‑mode styling for global UI.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component rendering all landing‑page sections inside an access‑code gate with error diagnostics and theme support.",
  "frontend/src/components/AccessCodeGate.tsx": "Manual access‑code gate requiring code entry and persisting unlock state in sessionStorage.",
  "frontend/src/components/AccessRestrictedScreen.tsx": "Empty component placeholder.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard showing bookings list and placeholder availability tab with role‑based access check.",
  "frontend/src/components/AvailabilityEditor.tsx": "Empty component placeholder for availability management UI.",
  "frontend/src/components/BookingSection.tsx": "Empty component placeholder for booking flow UI.",
  "frontend/src/components/BookingsManager.tsx": "Empty component placeholder.",
  "frontend/src/components/BuildFailureDiagnostics.tsx": "Displays and manages build/deployment error details with copy and dismiss actions.",
  "frontend/src/components/EthicsAndBoundaries.tsx": "Renders an informational ethics section explaining boundaries and disclaimers for sessions.",
  "frontend/src/components/Footer.tsx": "Site footer with a tagline, decorative elements, and credits.",
  "frontend/src/components/Hero.tsx": "Fullscreen hero section with background imagery, title, and tagline animations.",
  "frontend/src/components/InviteGate.tsx": "Gates access behind an invite secret stored in URL/session and shows locked UI when absent.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a cancellation notice after failed payment with a link back home.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays a success message and optional booking details parsed from URL params.",
  "frontend/src/components/PractitionerAuthority.tsx": "Presents practitioner bio, image, experience, and social links.",
  "frontend/src/components/PriceAndValue.tsx": "Shows session pricing and value explanation with supporting text.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ReadyToBookCTA.tsx": "Call‑to‑action section directing users to an external booking link.",
  "frontend/src/components/SectionShell.tsx": "Reusable layout wrapper providing section spacing, styling variants, and optional labels.",
  "frontend/src/components/SessionStructure.tsx": "React component rendering a four‑step session overview using SectionShell and styled content.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty file with no implemented component.",
  "frontend/src/components/WhatItIs.tsx": "SectionShell component describing the purpose of The Clearing and listing what it is not.",
  "frontend/src/components/WhatToExpect.tsx": "Component outlining what happens during a session and when the work is most helpful, using structured text and separators.",
  "frontend/src/components/WhoThisIsFor.tsx": "Component detailing audiences for whom the service is or isn’t appropriate, split into two lists.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity auth, including login, logout, status tracking, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, Stripe config, checkout sessions, bookings, and admin checks using the actor API.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode values, and typography with custom gold shimmer animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/utils/captureAppErrors.ts": "Implements a global error capture utility that records errors, notifies listeners, and supports retrieval and clearing.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata summarizing the DApp architecture, features, issues, and design notes for the booking and payment system."
}