{
  "backend/main.mo": "Main backend canister handling user profiles, access control, Stripe checkout/session operations, and booking-related types using storage and authorization mixins.",
  "feature_evidence.json": "Machine-generated feature evidence listing deployment, domain-doc, and runbook features with associated files, components, tests, and confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend components, hooks, styling, and layout behavior across the application.",
  "frontend/DEPLOYMENT_LOG_CAPTURE_TEMPLATE.md": "Template for recording environment details and full stdout/stderr logs during build and deployment.",
  "frontend/DEPLOYMENT_NOTE_clearing-icp0-io.md": "Diagnostic note template for capturing and troubleshooting production URL errors at clearing.icp0.io.",
  "frontend/DOMAIN_SETUP_GUIDE.md": "Guide explaining how to buy a domain, configure DNS, and map it to the IC frontend canister with registrar comparisons.",
  "frontend/index.css": "Global Tailwind CSS variables and themes defining OKLCH-based color system, light/dark mode tokens, and base styles.",
  "frontend/index.html": "HTML shell that loads the React app and includes a build timestamp meta tag.",
  "frontend/PRODUCTION_DEPLOY_CHECKLIST.md": "Step-by-step production deployment checklist covering build, deploy, verification, custom-domain checks, and accessibility tests.",
  "frontend/PRODUCTION_GO_LIVE_RUNBOOK.md": "Structured runbook outlining prerequisites, pre-deployment checks, and environment validation for going live.",
  "frontend/src/App.tsx": "Main app component wiring themes, error handling, access gate, and all landing-page sections.",
  "frontend/src/components/AccessCodeGate.tsx": "Manual access-code gate component that unlocks content via session storage and provides copyable gate link.",
  "frontend/src/components/AccessRestrictedScreen.tsx": "Empty placeholder component.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard showing bookings and an availability tab, with permission checks and loading states.",
  "frontend/src/components/AvailabilityEditor.tsx": "Empty placeholder component.",
  "frontend/src/components/BookingSection.tsx": "Empty placeholder component.",
  "frontend/src/components/BookingsManager.tsx": "Empty placeholder component.",
  "frontend/src/components/BuildFailureDiagnostics.tsx": "Displays detailed build/deployment error diagnostics with copy-to-clipboard and dismissal controls.",
  "frontend/src/components/EthicsAndBoundaries.tsx": "Section outlining ethical boundaries, disclaimers, and client responsibility expectations.",
  "frontend/src/components/Footer.tsx": "Footer with branding line, decorative dividers, and a link to caffeine.ai.",
  "frontend/src/components/Hero.tsx": "Hero section with layered celestial visuals, title, badge, and tagline.",
  "frontend/src/components/InviteGate.tsx": "Checks for an invite secret in the URL or session storage and gates access, showing a locked screen until unlocked.",
  "frontend/src/components/PaymentFailure.tsx": "Displays a payment-cancelled message with guidance and a button to return home.",
  "frontend/src/components/PaymentSuccess.tsx": "Shows a payment confirmation screen and optionally displays booking details parsed from URL parameters.",
  "frontend/src/components/PractitionerAuthority.tsx": "Presents practitioner bio, headshot, and social links along with descriptive background text.",
  "frontend/src/components/PriceAndValue.tsx": "Displays pricing for a session and explanatory text about the value and purpose of the work.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ReadinessQuiz.tsx": "Interactive readiness quiz that tallies yes/no answers and shows pass/fail results with booking links.",
  "frontend/src/components/ReadyToBookCTA.tsx": "Call‑to‑action section inviting users to book a session with a styled booking button.",
  "frontend/src/components/SectionShell.tsx": "Reusable layout wrapper that adds spacing, backgrounds, motifs, and optional labels or dividers to sections.",
  "frontend/src/components/SessionStructure.tsx": "Outlines the four‑phase session structure using styled cards within a section wrapper.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/WhatItIs.tsx": "Renders a section describing what The Clearing is, emphasizing its structure and what it is not through styled text and lists.",
  "frontend/src/components/WhatToExpect.tsx": "Displays an overview of what clients can expect from The Clearing, including goals, session flow, and clarifying-list items.",
  "frontend/src/components/WhoThisIsFor.tsx": "Defines who The Clearing is for and not for using two lists and includes a readiness quiz component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for interacting with backend APIs like profiles, bookings, Stripe config, and checkout sessions.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, typography rules, accessibility focus styles, and decorative gold/shimmer utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and imports global styles.",
  "frontend/src/utils/captureAppErrors.ts": "Implements a global error capture system that logs runtime and promise errors and allows subscribers to receive updates.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including OKLCH color variables, gold accent system, typography, spacing, and plugins.",
  "project_state.json": "Stores project state metadata detailing deployment status, features, and pending requests for production publishing and domain setup guidance."
}