{
  "kind": "build_request",
  "title": "Remove recording promise and update session participation copy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Update the landing-page copy to remove all mentions of providing/sending a session recording afterward, and replace it with copy that (1) states the session requires the participant’s active engagement and participation during the call, (2) welcomes the participant to take notes to integrate what is learned, and (3) clearly explains that a recording is intentionally not provided so the participant is not tempted to disengage with the idea of “listening to the recording later.” Use English for all user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Let's remove the part of the copy that talks about sending a recording afterwards. Instead, let's inform in the copy that the session will require the participant's active engagement and participation during the session, and that they are welcome to take notes to integrate what is learned in the session. We intentionally don't provide a recording so the participant isn't tempted to not be fully present during the session with the pretext that they can just \"listen to the recording later\", you know."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/WhatToExpect.tsx, the sentence \"The session is recorded and sent to you afterward for your own reflection.\" is removed or rewritten so it does not imply a recording will be provided.",
        "In the \"After the Session\" subsection of frontend/src/components/WhatToExpect.tsx, the paragraph \"You will receive a recording of the session within 24 hours...\" is removed and replaced with copy that: (a) emphasizes active engagement/presence during the session, (b) explicitly invites note-taking, and (c) states that recordings are intentionally not provided to support full presence.",
        "No other landing-page sections contain any remaining promise or implication that a recording will be provided after the session."
      ]
    }
  ],
  "constraints": [
    "Do not change application functionality or flows (copy-only change).",
    "Do not modify files under frontend/src/components/ui (compose existing UI components only)."
  ],
  "nonGoals": [
    "Adding a recording feature or any post-session content delivery functionality.",
    "Changing pricing, session length, booking/payment behavior, or access gating behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}