{
  "kind": "build_request",
  "title": "Remove Practitioner banner and further refine Access Code gate visuals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Remove the Aurora Arcana banner image rendering from the PractitionerAuthority section so no banner is displayed at the bottom of the section, while keeping the existing TikTok and Instagram access links intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The banner is not being displayed correctly. Just forget about it. Keep the tiktok and insta access links though."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/PractitionerAuthority.tsx, the bottom banner <img> block is removed (or otherwise not rendered) so the banner is no longer shown on the landing page.",
        "The TikTok link to https://tiktok.com/@auroraarcanallc remains visible and functional.",
        "The Instagram link to https://instagram.com/auroraarcanallc remains visible and functional.",
        "No other PractitionerAuthority content (headshot, biography copy) is removed as part of this change."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Refine the access-code gate entry page (the screen shown when the user must enter code 1122) to feel more visually enticing, mysterious, engaging, and provoking, while keeping the UI readable and aligned with the existing dark + gold design system.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also, can we refine the \"gate\" entry page where we enter the access code to be like... more visually enticing and mysterious and engaging and provoking?"
        ]
      },
      "acceptanceCriteria": [
        "The locked gate UI in frontend/src/components/AccessCodeGate.tsx is visually enhanced (e.g., richer background treatment, more deliberate lighting/glow, subtle motion/animation, improved typography/spacing) while preserving the current dark + gold palette.",
        "User-facing text on the gate remains in English.",
        "The functional behavior of the gate remains unchanged: code \"1122\" unlocks, incorrect codes show an error, and sessionStorage persistence continues to work as currently implemented.",
        "The refined visuals do not reduce usability: input is clearly discoverable, error text remains legible, and the page works on mobile and desktop sizes."
      ]
    }
  ],
  "constraints": [
    "Do not change the access code value (must remain \"1122\").",
    "Keep all user-facing text in English.",
    "Do not remove the TikTok and Instagram access links in PractitionerAuthority.",
    "Do not modify files under frontend/src/components/ui or other frontend immutable paths; compose with existing UI components instead."
  ],
  "nonGoals": [
    "Do not add or change backend canister logic.",
    "Do not introduce invite-link gating; keep the manual access-code gate flow.",
    "Do not redesign or reorder landing-page sections beyond the banner removal in PractitionerAuthority."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}