{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Practitioner banner and refine Access Code gate visuals",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Remove the Aurora Arcana banner image from the PractitionerAuthority section while keeping TikTok and Instagram links intact.",
      "acceptanceCriteria": [
        "In frontend/src/components/PractitionerAuthority.tsx, the bottom banner <img> block is removed (or otherwise not rendered) so the banner is no longer shown on the landing page.",
        "The TikTok link to https://tiktok.com/@auroraarcanallc remains visible and functional.",
        "The Instagram link to https://instagram.com/auroraarcanallc remains visible and functional.",
        "No other PractitionerAuthority content (headshot, biography copy) is removed as part of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PractitionerAuthority.tsx",
          "operation": "modify",
          "description": "Remove (or conditionally disable) the bottom \"Aurora Arcana Banner\" rendering block so no banner image is displayed, leaving the headshot, bio copy, and TikTok/Instagram social links unchanged and functional."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Visually enhance the access-code gate screen to feel more enticing and mysterious while preserving the dark + gold design and keeping gate behavior unchanged.",
      "acceptanceCriteria": [
        "The locked gate UI in frontend/src/components/AccessCodeGate.tsx is visually enhanced (e.g., richer background treatment, more deliberate lighting/glow, subtle motion/animation, improved typography/spacing) while preserving the current dark + gold palette.",
        "User-facing text on the gate remains in English.",
        "The functional behavior of the gate remains unchanged: code \"1122\" unlocks, incorrect codes show an error, and sessionStorage persistence continues to work as currently implemented.",
        "The refined visuals do not reduce usability: input is clearly discoverable, error text remains legible, and the page works on mobile and desktop sizes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessCodeGate.tsx",
          "operation": "modify",
          "description": "Refine the locked-gate layout styling only (no logic changes): add a more deliberate layered background treatment, enhance gold glow/lighting around the lock + call-to-action, improve typography/spacing hierarchy, and introduce subtle, non-distracting animation/motion accents while keeping all user-facing text in English and preserving the existing code-check + sessionStorage behavior (code remains \"1122\")."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust global utility classes and keyframe animations used by the AccessCodeGate visuals (e.g., subtle shimmer/ambient glow/slow drift), ensuring they stay within the existing dark + gold palette and remain responsive/accessible (legible text, non-obscuring effects)."
        }
      ]
    }
  ]
}