{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Landing page copy updates for connection/benefits and Readiness section reordering",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Update “After the Session” copy to remove “no ongoing relationship” while welcoming bounded connection without encouraging dependency.",
      "acceptanceCriteria": [
        "In frontend/src/components/WhatToExpect.tsx under the “After the Session” subsection, the phrase asserting “no ongoing relationship” (or equivalent) is removed.",
        "Replacement text explicitly communicates that clients should not become dependent on the practitioner/offering.",
        "Replacement text explicitly communicates that ongoing connection/contact is welcome/possible (within appropriate boundaries), without implying an obligation or dependency.",
        "All updated copy is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WhatToExpect.tsx",
          "operation": "modify",
          "description": "Revise the “After the Session” paragraph(s) to remove the “no ongoing relationship” language and replace it with English copy that (1) reinforces self-responsibility/non-dependence and (2) permits future contact/continued connection in clear, bounded terms (e.g., optional check-ins, future sessions, periodic touchpoints), without implying obligation or reliance."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Reorder landing-page section render order so Readiness (<WhoThisIsFor />) appears immediately after Foundation (<WhatItIs />).",
      "acceptanceCriteria": [
        "In frontend/src/App.tsx, <WhoThisIsFor /> is rendered immediately after <WhatItIs />.",
        "No landing-page section components are deleted; only ordering is changed.",
        "The page still renders all sections (Hero, WhatItIs, WhoThisIsFor/Readiness, WhatToExpect, SessionStructure, PractitionerAuthority, PriceAndValue, EthicsAndBoundaries, ReadyToBookCTA, Footer)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Change only the JSX render order of landing-page sections so <WhoThisIsFor /> is placed immediately after <WhatItIs />, keeping all other sections present and functional (copy/order change only; no deletions)."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Strengthen “What to Expect from The Clearing” copy to communicate concrete practical benefits while preserving readiness-filtering and existing disclaimers.",
      "acceptanceCriteria": [
        "frontend/src/components/WhatToExpect.tsx contains updated/expanded copy that clearly enumerates concrete, practical benefits/outcomes a participant can expect from the session.",
        "The revised copy preserves a readiness filter (e.g., requiring willingness to engage, responsibility, discomfort tolerance) and does not read as hype-driven or manipulative.",
        "The updated copy remains consistent with existing constraints already stated in the section (non-predictive tarot, not therapy, active engagement, not recorded, 90-minute session).",
        "All revised/added user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WhatToExpect.tsx",
          "operation": "modify",
          "description": "Update/expand the user-facing English copy within “What to Expect from The Clearing” to more concretely describe practical, tangible outcomes (e.g., clarifying decisions, naming the real issue, surfacing patterns/choices, identifying next steps, distinguishing signal vs. noise) while maintaining the readiness filter and keeping all existing constraints/disclaimers intact (tarot is reflective/non-predictive, not therapy, active engagement, not recorded, 90 minutes)."
        }
      ]
    }
  ]
}