{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 29,
  "summary": "A web-based booking and payment DApp for “The Clearing™” (a 90‑minute, one-to-one, non-predictive tarot-based clarity session). The React/Tailwind frontend serves a high-authority landing page, supports Internet Identity authentication, can optionally gate access via invite/access code screens, forces first-time users to complete a profile (name/email), lets authenticated users pick an available date/time and pay via Stripe Checkout, and shows payment success/failure pages. An admin-only dashboard allows configuring weekly availability and managing bookings, including adding a virtual meeting link for paid sessions. The Motoko backend canister implements access control (first admin via secret token), stores user profiles, availability slots, bookings, and integrates with Stripe via HTTPS outcalls to create Checkout sessions and query session status. The repo also includes a build-template scaffolding (frontend/backend canister configs, scripts, and tooling) for deployment packaging.",
  "architectural_notes": [
    "Internet Computer architecture: Motoko canister backend + React SPA frontend using generated actor interface (createActorWithConfig).",
    "Authentication via Internet Identity using @dfinity/auth-client; identity context provided by a React Context provider.",
    "Role-based access control implemented in Motoko (admin/user/guest) with a first-admin bootstrap using an environment variable token and a caller-provided secret.",
    "Frontend data access centralized as React Query hooks (useQuery/useMutation) with query invalidation on mutations.",
    "Admin token handling on frontend via URL hash secret extraction and sessionStorage persistence (getSecretParameter).",
    "Stripe integration performed server-side in the canister using IC HTTPS outcalls (ic:http_request) with a transform function to strip headers.",
    "UI built with Tailwind + shadcn/ui components; next-themes used for dark mode theming.",
    "Frontend uses lightweight hash-based “routing” by inspecting window.location.hash for payment result pages rather than a router library.",
    "Availability modeled as recurring weekly slots with optional blackout dates, exposed publicly for the booking UI.",
    "Includes a generic blob-storage mixin/module for Caffeine storage gateway authorization and cycle refilling (appears template/optional in this project)."
  ],
  "known_issues": [
    "Backend time handling is incomplete: extractTimeOfDay() always returns 00:00 and extractDayOfWeek() always returns Monday, making availability enforcement and conflict checking incorrect.",
    "Frontend booking flow creates a Stripe Checkout session but does not call backend createBooking(); bookings may never be created/stored unless another flow exists outside the provided code.",
    "No automated payment confirmation flow is present (e.g., Stripe webhooks or post-payment session verification) to update Booking.paymentStatus; admin-only manual updates exist but are not wired in the UI shown.",
    "getCallerUserProfile() traps for anonymous callers (requires #user), but the frontend may still attempt to query it when using an anonymous actor, potentially producing avoidable errors.",
    "React Query invalidation keys are inconsistent: some mutations invalidate ['bookings'] while the primary admin list query uses ['allBookings'], so UI may not refresh as expected.",
    "Stripe Checkout request body uses shipping_address_collection[allowed_countries][0] for every country in a loop (index not incremented), likely resulting in only one allowed country being honored.",
    "Sensitive Stripe secret key is stored in canister memory (not shown as stable/encrypted) and may be lost on upgrade; persistence and secret management are not addressed.",
    "Data stores (userProfiles Map, bookings Map, stripeConfiguration var, availability list) are not implemented as stable variables; state will be lost across canister upgrades.",
    "BookingSection time-slot generation is simplistic (hourly only, ignores minutes/15-min increments and blackoutDates/isRecurring semantics) and does not check already-booked times client-side.",
    "Environment variable name typo risk in blob storage module (CAFFFEINE_STORAGE_CASHIER_PRINCIPAL has triple 'F'), which may break configuration if used."
  ],
  "isFixRequest": false,
  "generatedImages": [
    {
      "filename": "frontend/public/assets/generated/practitioner-headshot.dim_400x400.jpg",
      "description": "Generated dimmed practitioner headshot image used in the authority/practitioner section.",
      "targetWidth": 400,
      "targetHeight": 400
    }
  ],
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Marketing landing page content sections",
      "synonyms": [
        "Landing page",
        "Marketing site sections"
      ],
      "description": "Presents a structured landing page for The Clearing™ including Hero CTA, “What It Is”, “What To Expect”, session structure, audience fit (“for/not for”), practitioner profile with social links, pricing, ethics/boundaries, and footer attribution.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Dark mode theming and design system",
      "synonyms": [
        "ThemeProvider",
        "Tailwind tokens"
      ],
      "description": "Implements a minimalist dark-mode-first UI using Tailwind with OKLCH design tokens and next-themes ThemeProvider to support theme switching/system preference.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Internet Identity authentication",
      "synonyms": [
        "II login",
        "AuthClient"
      ],
      "description": "Provides login/logout and persisted identity loading using @dfinity/auth-client and a React Context provider; supports long-lived delegations (30 days) with idle handling disabled by default.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Backend actor creation and identity-aware client",
      "synonyms": [
        "useActor",
        "createActorWithConfig"
      ],
      "description": "Creates an anonymous actor when not authenticated and an identity-bound actor when authenticated; on actor creation it initializes access control and triggers global query invalidation/refetch when identity changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Role-based access control with admin bootstrap secret",
      "synonyms": [
        "AccessControl",
        "Admin token bootstrap"
      ],
      "description": "Motoko access-control system with roles (admin/user/guest). First eligible caller can become admin by providing a matching secret token (compared against CAFFEINE_ADMIN_TOKEN env var). Includes admin role assignment and admin checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Secure admin token ingestion from URL hash",
      "synonyms": [
        "URL secret handling",
        "getSecretParameter"
      ],
      "description": "Extracts sensitive parameters (e.g., caffeineAdminToken) from the URL hash, persists them in sessionStorage, and removes them from the URL to reduce history/referrer leakage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "User profile storage (name/email) with forced first-time setup",
      "synonyms": [
        "Profile setup modal",
        "UserProfile"
      ],
      "description": "Backend stores a per-principal user profile (name and email). Frontend enforces completion via a modal that cannot be dismissed until a profile is saved.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Stripe configuration (admin-only)",
      "synonyms": [
        "Stripe secret key setup",
        "StripeSetupModal"
      ],
      "description": "Admin-only Stripe configuration workflow: backend stores Stripe secret key and allowed countries; frontend shows a modal on admin login if Stripe is not configured.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Stripe Checkout session creation via canister outcalls",
      "synonyms": [
        "Checkout session",
        "Stripe outcalls"
      ],
      "description": "Backend calls Stripe’s Checkout Sessions API using IC HTTPS outcalls; frontend initiates checkout for a predefined $177 “The Clearing™ Session” item and redirects the browser to the returned Checkout URL.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Payment success and failure pages",
      "synonyms": [
        "Payment result routing",
        "Checkout return"
      ],
      "description": "After Stripe redirects back to /#/payment-success or /#/payment-failure, the app shows full-screen success/failure pages. The success page displays booking details read from sessionStorage (pendingBooking).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Availability modeling and admin availability editor",
      "synonyms": [
        "Time slots",
        "Schedule management"
      ],
      "description": "Backend stores a list of Availability slots (day-of-week, start/end time, recurring flag, blackout dates). Admin UI supports adding/removing/editing slots with day/time selectors and saving changes to the backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Client booking UI based on availability",
      "synonyms": [
        "BookingSection",
        "Calendar picker"
      ],
      "description": "Authenticated users can select a date using a calendar that disables days without availability, then select a time derived from availability slots (hourly generation) before proceeding to Stripe payment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Bookings data model and admin booking management endpoints",
      "synonyms": [
        "Bookings CRUD",
        "Booking records"
      ],
      "description": "Backend defines Booking records (owner, client name/email, session time, payment status, booking time, optional virtual meeting link) and provides endpoints to create, read, cancel, list by client email, list all (admin), and update payment status (admin).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Admin bookings dashboard with virtual meeting link assignment",
      "synonyms": [
        "BookingsManager",
        "Meeting link workflow"
      ],
      "description": "Admin UI lists all bookings with status badges, shows summaries of paid bookings with/without meeting links, and provides a guided dialog to add/update a Google Meet/Zoom meeting link stored on the booking.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "HTTP outcall utility layer for GET/POST with transform",
      "synonyms": [
        "OutCall module",
        "IC.http_request wrapper"
      ],
      "description": "Shared Motoko module wrapping IC http_request for GET/POST, adding headers (User-Agent, Idempotency-Key for POST), attaching a transform function, and decoding UTF-8 responses.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Stripe session status lookup",
      "synonyms": [
        "Payment status polling",
        "getSessionStatus"
      ],
      "description": "Backend can query Stripe’s Checkout Session endpoint and returns a parsed status variant (completed/failed) including extraction of client_reference_id (principal) when present.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Admin dashboard container UI",
      "synonyms": [
        "AdminDashboard",
        "Settings entrypoint"
      ],
      "description": "Frontend provides an admin-only floating settings button that opens a full-screen dashboard with tabs for availability management and booking management.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "App access gating screens (invite/access code/restricted)",
      "synonyms": [
        "InviteGate",
        "AccessCodeGate",
        "AccessRestrictedScreen"
      ],
      "description": "Frontend includes dedicated gating screens/components to restrict access until an invite and/or access code condition is satisfied, showing a restricted-access screen when requirements are not met.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-replace-the-image-shown-in-the-the-practitioner-section-practitionerauthority-with-the-user-uploaded-photo-from-jan-20th-at-15-13-in-this-chat-and-ensure-the-image-is-served-as-a-static-asset-from-the-frontend",
      "title": "Replace the image shown in the “The Practitioner” section (PractitionerAuthority) with the user-uploaded photo from Jan 20th at 15:13 in this chat, and ensure the image is served as a static asset from the frontend.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-publish-the-currently-deployed-draft-of-the-app-as-the-live-published-version-without-changing-application-functionality",
      "title": "Publish the currently deployed draft of the app as the live (published) version without changing application functionality.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-headshot-image-used-in-the-facilitator-part-of-the-landing-page-currently-implemented-in-the-practitionerauthority-section-with-the-user-uploaded-image-file-whatsapp-image-2026-02-05-at-9-44-49-am-jpeg-and-serve-it-as-a-frontend-static-asset",
      "title": "Replace the headshot image used in the “Facilitator” part of the landing page (currently implemented in the PractitionerAuthority section) with the user-uploaded image file “WhatsApp Image 2026-02-05 at 9.44.49 AM.jpeg”, and serve it as a frontend static asset.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-redesign-the-landing-page-ui-to-feel-visually-engaging-serious-magnetizing-and-high-authority-with-stronger-emphasis-on-impact-and-benefits-of-the-clearing-while-keeping-the-overall-experience-cohesive-across-all-existing-sections-hero-whatitis-whattoexpect-sessionstructure-whothisisfor-practitionerauthority-priceandvalue-ethicsandboundaries-footer",
      "title": "Redesign the landing page UI to feel visually engaging, serious, magnetizing, and high-authority, with stronger emphasis on impact and benefits of “The Clearing™” while keeping the overall experience cohesive across all existing sections (Hero, WhatItIs, WhatToExpect, SessionStructure, WhoThisIsFor, PractitionerAuthority, PriceAndValue, EthicsAndBoundaries, Footer).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-landing-page-color-system-and-styling-to-include-more-popping-accents-that-evoke-authority-e-g-gold-metallic-accents-and-or-authoritative-pastel-accents-while-retaining-a-dark-aesthetic-apply-the-updated-palette-consistently-across-key-ui-elements-buttons-borders-dividers-highlights-section-backgrounds",
      "title": "Update the landing page color system and styling to include more ‘popping’ accents that evoke authority (e.g., gold/metallic accents and/or authoritative pastel accents) while retaining a dark aesthetic; apply the updated palette consistently across key UI elements (buttons, borders, dividers, highlights, section backgrounds).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-current-access-code-entry-gate-with-an-invite-link-gate-that-unlocks-the-landing-page-only-when-a-valid-invite-secret-is-provided-via-the-url-hash-fragment-and-then-persisted-for-the-browser-session-so-invited-users-can-access-the-page-by-opening-a-directly-forwarded-link-without-manually-entering-a-code",
      "title": "Replace the current access-code entry gate with an invite-link gate that unlocks the landing page only when a valid invite secret is provided via the URL hash fragment (and then persisted for the browser session), so invited users can access the page by opening a directly forwarded link without manually entering a code.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-app-s-publicly-shareable-gate-page-url-can-be-clean-and-stable-no-random-codes-in-the-visible-url-and-present-user-facing-gate-copy-that-reinforces-exclusivity-by-invitation-only-while-still-allowing-invited-users-to-proceed-after-opening-the-forwarded-link",
      "title": "Ensure the app’s publicly shareable ‘gate page’ URL can be clean and stable (no random codes in the visible URL), and present user-facing gate copy that reinforces exclusivity (‘by invitation only’) while still allowing invited users to proceed after opening the forwarded link.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-current-invite-link-gating-behavior-with-a-manual-access-code-gate-that-unlocks-the-landing-page-only-after-the-user-enters-the-access-code-1122-on-a-dedicated-gate-screen",
      "title": "Replace the current invite-link gating behavior with a manual access-code gate that unlocks the landing page only after the user enters the access code \"1122\" on a dedicated gate screen.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-manual-access-code-gate-ui-as-a-real-component-replacing-the-current-empty-placeholder-in-frontend-src-components-accesscodegate-tsx-and-wire-app-tsx-to-use-it-instead-of-frontend-src-components-invitegate-tsx",
      "title": "Implement the manual access-code gate UI as a real component (replacing the current empty placeholder in frontend/src/components/AccessCodeGate.tsx), and wire App.tsx to use it instead of frontend/src/components/InviteGate.tsx.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "feature-redesign-the-gate-page-visuals-and-micro-interactions-to-be-enticing-alluring-elegant-exclusive-clean-mysterious-and-rich-esoteric-occult-authority-slightly-intimidating-while-keeping-the-ui-readable-and-aligned-with-the-existing-dark-gold-design-system",
      "title": "Redesign the gate page visuals and micro-interactions to be enticing, alluring, elegant, exclusive, clean, mysterious, and \"rich esoteric/occult authority\" (slightly intimidating), while keeping the UI readable and aligned with the existing dark + gold design system.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "feature-re-run-the-full-build-deploy-pipeline-and-identify-the-exact-failing-step-motoko-compile-frontend-typescript-vite-build-asset-bundling-or-canister-deploy-capture-and-surface-the-full-underlying-error-output-so-the-failure-is-actionable",
      "title": "Re-run the full build + deploy pipeline and identify the exact failing step (Motoko compile, frontend TypeScript/Vite build, asset bundling, or canister deploy). Capture and surface the full underlying error output so the failure is actionable.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-whatever-code-configuration-issue-is-causing-the-build-deploy-to-fail-without-changing-intended-application-functionality-after-the-fix-the-project-must-build-successfully-and-deploy-successfully",
      "title": "Fix whatever code/configuration issue is causing the build/deploy to fail, without changing intended application functionality. After the fix, the project must build successfully and deploy successfully.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-current-invite-link-gating-behavior-with-a-manual-access-code-gate-that-unlocks-the-landing-page-only-after-the-user-enters-the-access-code-1122",
      "title": "Replace the current invite-link gating behavior with a manual access-code gate that unlocks the landing page only after the user enters the access code \"1122\".",
      "reqIds": [
        "REQ-13"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-manual-access-code-gate-ui-as-a-real-component-in-frontend-src-components-accesscodegate-tsx-currently-empty-and-wire-frontend-src-app-tsx-to-use-it-instead-of-frontend-src-components-invitegate-tsx",
      "title": "Implement the manual access-code gate UI as a real component in frontend/src/components/AccessCodeGate.tsx (currently empty), and wire frontend/src/App.tsx to use it instead of frontend/src/components/InviteGate.tsx.",
      "reqIds": [
        "REQ-14"
      ],
      "version": 1
    },
    {
      "id": "feature-move-the-primary-ready-to-book-call-to-action-so-it-appears-at-the-end-of-the-landing-page-after-all-informational-copy-sections-rather-than-in-the-hero-section",
      "title": "Move the primary “Ready to Book” call-to-action so it appears at the end of the landing page (after all informational/copy sections), rather than in the hero section.",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    },
    {
      "id": "feature-update-landing-page-copy-to-reflect-that-the-session-duration-is-90-minutes-replacing-any-existing-references-to-75-minutes",
      "title": "Update landing-page copy to reflect that the session duration is 90 minutes (replacing any existing references to 75 minutes).",
      "reqIds": [
        "REQ-16"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-landing-page-copy-to-remove-all-mentions-of-providing-sending-a-session-recording-afterward-and-replace-it-with-copy-that-1-states-the-session-requires-the-participant-s-active-engagement-and-participation-during-the-call-2-welcomes-the-participant-to-take-notes-to-integrate-what-is-learned-and-3-clearly-explains-that-a-recording-is-intentionally-not-provided-so-the-participant-is-not-tempted-to-disengage-with-the-idea-of-listening-to-the-recording-later-use-english-for-all-user-facing-text",
      "title": "Update the landing-page copy to remove all mentions of providing/sending a session recording afterward, and replace it with copy that (1) states the session requires the participant’s active engagement and participation during the call, (2) welcomes the participant to take notes to integrate what is learned, and (3) clearly explains that a recording is intentionally not provided so the participant is not tempted to disengage with the idea of “listening to the recording later.” Use English for all user-facing text.",
      "reqIds": [
        "REQ-17"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-after-the-session-copy-in-the-what-to-expect-from-the-clearing-section-frontend-src-components-whattoexpect-tsx-to-remove-the-statement-that-there-is-no-ongoing-relationship-and-replace-it-with-wording-that-a-clearly-avoids-client-dependency-and-b-still-welcomes-permits-ongoing-connection-e-g-future-contact-or-staying-connected-in-a-bounded-non-dependent-way-use-english-for-all-user-facing-text",
      "title": "Update the “After the Session” copy in the “What to Expect from The Clearing” section (frontend/src/components/WhatToExpect.tsx) to remove the statement that there is “no ongoing relationship,” and replace it with wording that (a) clearly avoids client dependency and (b) still welcomes/permits ongoing connection (e.g., future contact or staying connected) in a bounded, non-dependent way. Use English for all user-facing text.",
      "reqIds": [
        "REQ-18"
      ],
      "version": 1
    },
    {
      "id": "feature-reorder-the-landing-page-sections-so-the-readiness-section-currently-rendered-by-frontend-src-components-whothisisfor-tsx-appears-immediately-after-the-foundation-section-frontend-src-components-whatitis-tsx-near-the-top-of-the-landing-page-implement-by-updating-the-render-order-in-frontend-src-app-tsx-without-removing-any-sections",
      "title": "Reorder the landing-page sections so the “Readiness” section (currently rendered by frontend/src/components/WhoThisIsFor.tsx) appears immediately after the “Foundation” section (frontend/src/components/WhatItIs.tsx) near the top of the landing page. Implement by updating the render order in frontend/src/App.tsx without removing any sections.",
      "reqIds": [
        "REQ-19"
      ],
      "version": 1
    },
    {
      "id": "feature-revise-the-copy-in-the-what-to-expect-from-the-clearing-section-frontend-src-components-whattoexpect-tsx-to-more-strongly-and-concretely-communicate-the-immense-opportunity-value-and-specific-practical-benefits-of-the-session-while-still-maintaining-readiness-filtering-language-and-an-informative-not-seductive-tone-use-practical-tangible-visible-helpful-outcome-language-e-g-clarity-on-decisions-naming-the-real-issue-identifying-next-steps-seeing-patterns-choices-use-english-for-all-user-facing-text",
      "title": "Revise the copy in the “What to Expect from The Clearing” section (frontend/src/components/WhatToExpect.tsx) to more strongly and concretely communicate the immense opportunity/value and specific practical benefits of the session, while still maintaining readiness-filtering language and an informative (not “seductive”) tone. Use practical, tangible, visible, helpful outcome language (e.g., clarity on decisions, naming the real issue, identifying next steps, seeing patterns/choices). Use English for all user-facing text.",
      "reqIds": [
        "REQ-20"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Replace the “The Practitioner” section image with the user-uploaded photo (Jan 20th, 15:13)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Redesign landing page to feel more visually engaging, serious, magnetizing, and authoritative; emphasize impact/benefits with more compelling visuals/copy",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Set up a clean official hyperlink/custom domain without random codes (e.g., https://www.theclearing.caffeine) and confirm it can be shared with clients",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Update visual design/colors to include more “popping” accents (e.g., gold/metallics or authoritative pastels) while keeping a dark aesthetic if needed",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Keep manual access-code gate (code 1122) and redesign the gate page to feel enticing, elegant, exclusive, clean, mysterious—rich esoteric/occult high-authority vibes (slightly intimidating)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Move the primary “Ready to book” CTA button to the end of the landing page (after the full informational/copy sections)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Update landing page copy to reflect session duration as 90 minutes (was 75 minutes)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Update landing page/session copy to remove any mention of sending a recording afterward; instead emphasize active engagement during the session, encourage note-taking for integration, and clarify recordings are intentionally not provided to support full presence",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Update “After the session” copy to remove/soften the “no ongoing relationship” language; clarify the intent to avoid dependency while still welcoming ongoing connection",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Reorder landing-page sections so “Readiness” appears immediately after the “Foundation” section near the top",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Revise “What to Expect From The Clearing” copy to more clearly communicate immense practical/tangible benefits and value while still filtering for readiness (informative, not seductive)",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "The Clearing™",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}